app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT "shops".* FROM "shops"

  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("book_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["book_id", 111111111], ["created_at", Sat, 21 Sep 2013 13:49:39 UTC +00:00], ["updated_at", Sat, 21 Sep 2013 13:49:39 UTC +00:00]]

  def update
    respond_to do |format|
      if @shop.update(shop_params)
---
UPDATE "shops" SET "latitude" = ?, "longitude" = ?, "close_time" = ?, "updated_at" = ? WHERE "shops"."id" = 4  [["latitude", 35.68368], ["longitude", 139.76631], ["close_time", 2013-09-21 14:18:00 UTC], ["updated_at", Sat, 21 Sep 2013 14:19:08 UTC +00:00]]

  def search
  	#検索範囲(km)
  	#@rng = params[:rng]
  	#経度
  	@lat = params[:latitude]
  	#緯度
  	@lng = params[:longitude]

  	@shop_all = Shop.all
---
SELECT "shops".* FROM "shops" WHERE ('all')

    def set_shop
      @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "11"]]