app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "wishlist_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 22 Sep 2013 15:51:26 UTC +00:00], ["email", "aaaa"], ["password", "aaaaaaa"], ["updated_at", Sun, 22 Sep 2013 15:51:26 UTC +00:00], ["wishlist_id", 111111111]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["email", "AAAAAAAAAA33"], ["password", "AAAAAAAAA1"], ["updated_at", Sun, 22 Sep 2013 15:56:07 UTC +00:00]]