app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists"
---
  def index
    @wishlists = Wishlist.all